TheWeeknd/app/Controllers/Admin.php

SELECT *
FROM `album`
SELECT *
FROM `lagu`
SELECT *
FROM `merchandise`
SELECT *
FROM `tour`
SELECT *
FROM `users`
---
    public function adminView()
    {
        $albumModel = new AlbumModel();
        $laguModel = new LaguModel();
        $merchModel = new MerchandiseModel();
        $tourModel = new TourModel();
        $userModel = new UserModel();

        $data = [
            'albums' => $albumModel->findAll(),
            'lagus' => $laguModel->findAll(),
            'merchandise' => $merchModel->findAll(),
            'tours' => $tourModel->findAll(),
            'users' => $userModel->findAll()
        ];