TheWeeknd/app/Controllers/Auth.php

    public function index()
    {
        $data = [];
        helper(['form']);

        if ($this->request->getMethod() === 'post') {
            $rules = [
                'username' => 'required|min_length[1]|max_length[20]|alpha_numeric',
                'pass' => 'required|min_length[1]|max_length[100]',
            ];

            if (!$this->validate($rules)) {
                $data['validation'] = $this->validator;
            } else {
                $model = new UserModel();

                $user = $model->where('username', $this->request->getPost('username'))->first();
---
SELECT *
FROM `users`
WHERE `username` = 'exsfo'
 LIMIT 1