TheWeeknd/app/Controllers/MusicController.php

    public function weekndSongs()
    {
        $artistId = '1Xyo4u8uXC1ZmMpatF05PJ'; // The Weeknd's Spotify ID
        $albums = $this->spotifyApi->getArtistAlbums($artistId);

        $allTracks = [];

        $cache = \Config\Services::cache();
        $cacheKey = 'weekndSongsData';
        $allTracks = $cache->get($cacheKey);


        $albumModel = new AlbumModel();
        $laguModel = new LaguModel();


        foreach ($albums->items as $album) {
            $albumData = [
                'nama_album' => $album->name,
                'tahun_rilis' => substr($album->release_date, 0, 4),
                'album_image' => $album->images[0]->url,
                'spotify_id' => $album->id
            ];

             $albumModel->save($albumData);
            $albumId = $albumModel->insertID();

            $tracksData = $this->spotifyApi->getAlbumTracks($album->id);
            foreach ($tracksData->items as $track) {
                $laguModel->save([
                    'nama_lagu' => $track->name,
                    'durasi_lagu' => gmdate("H:i:s", $track->duration_ms / 1000),
                    'id_album' => $albumId,
                    'lagu_image' => $album->images[0]->url,
                    'spotify_id' => $track->id
                ]);
---
INSERT INTO `album` (`nama_album`, `tahun_rilis`, `album_image`, `spotify_id`) VALUES ('Starboy (Deluxe)', '2023', 'https://i.scdn.co/image/ab67616d0000b2738ad8f5243d6534e03b656c8b', '35dut3ICqF3NEDkjxfzJJ1')
INSERT INTO `lagu` (`nama_lagu`, `durasi_lagu`, `id_album`, `lagu_image`, `spotify_id`) VALUES ('Starboy (feat. Daft Punk)', '00:03:50', 1, 'https://i.scdn.co/image/ab67616d0000b2738ad8f5243d6534e03b656c8b', '76yLBykniz0SSNv0jj17M2')