TheWeeknd/app/Controllers/Pages.php

    public function viewAlbumAdmin()
    {
        $albumModel = new AlbumModel();
        $data['albums'] = $albumModel->findAll();
---
SELECT *
FROM `album`